; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v4)
             (pred_10 ?v6 ?v1)
             (pred_6 ?v5 ?v1)
             (pred_3 ?v7 ?v5 )
	     (pred_7 ?v5)
             (pred_12 ?v8)
             (pred_1 ?v6)
             (pred_9 ?v1)
             (pred_2 ?v5)
             (pred_4 ?v6)
             (pred_11 ?v5)
             (pred_8 ))



(:action op_5
:parameters (?v12 ?v2 ?v9 ?v10)
:precondition (and (pred_12 ?v12) (pred_12 ?v2) (pred_1 ?v9) (pred_9 ?v10)
          (pred_5 ?v12 ?v2) (pred_10 ?v9 ?v10)
                   (pred_6 ?v2 ?v10) (pred_7 ?v12) 
                   (pred_2 ?v2) (pred_4 ?v9))
:effect (and  (pred_11 ?v2) (not (pred_2 ?v2))))


(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_12 ?v12) (pred_12 ?v13)
               (pred_7 ?v12) (pred_5 ?v12 ?v13) (pred_11 ?v13))
:effect (and (pred_7 ?v13) (not (pred_7 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_1 ?v9) 
                  (pred_7 ?v12) (pred_3 ?v9 ?v12) (pred_8 ))
:effect (and (pred_4 ?v9)
   (not (pred_3 ?v9 ?v12)) (not (pred_8 ))))


(:action op_2
:parameters (?v12 ?v11 ?v3)
:precondition (and (pred_12 ?v12) (pred_1 ?v11) (pred_1 ?v3)
                  (pred_7 ?v12) (pred_4 ?v3) (pred_3 ?v11 ?v12))
:effect (and (pred_4 ?v11) (pred_3 ?v3 ?v12)
        (not (pred_4 ?v3)) (not (pred_3 ?v11 ?v12))))

(:action op_4
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_1 ?v9) 
                  (pred_7 ?v12) (pred_4 ?v9))
:effect (and (pred_8 ) (pred_3 ?v9 ?v12) (not (pred_4 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_02 obj_05 obj_12 obj_16 obj_04 obj_20 obj_07 obj_08 obj_06 obj_13 obj_11 obj_14 obj_09 obj_17 obj_19
    obj_10 obj_18
    obj_15 obj_03
    )

    (:init
       (pred_8)

       (pred_12 obj_01)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_08)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_9 obj_10)
       (pred_9 obj_18)
       (pred_1 obj_15)
       (pred_1 obj_03)

       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_16 obj_08)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_07)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_07 obj_20)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_16)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_17 obj_19)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_17)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_6  obj_19 obj_10)
       (pred_6  obj_06 obj_18)
       (pred_11 obj_01)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_04)
       (pred_11 obj_20)
       (pred_11 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_13)
       (pred_11 obj_11)
       (pred_11 obj_14)
       (pred_11 obj_09)
       (pred_11 obj_17)

       (pred_10  obj_15 obj_10)
       (pred_10  obj_03 obj_18)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_03 obj_05)
       (pred_7 obj_11)
    )

    (:goal (and
       (pred_3 obj_15 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_20)))
)
)

; plan
1. (op_1 obj_11 obj_07)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_07)
   goals met: 0 of 1
2. (op_1 obj_07 obj_12)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_12)
   goals met: 0 of 1
3. (op_1 obj_12 obj_05)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_02)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_02)
   goals met: 0 of 1
5. (op_1 obj_02 obj_01)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_16)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_16)
   goals met: 0 of 1
7. (op_3 obj_16 obj_15)
   deleted: (pred_3 obj_15 obj_16) (pred_8)
   added: (pred_4 obj_15)
   goals met: 0 of 1
8. (op_1 obj_16 obj_08)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_08)
   goals met: 0 of 1
9. (op_4 obj_08 obj_15)
   deleted: (pred_4 obj_15)
   added: (pred_8) (pred_3 obj_15 obj_08)
   goals met: 1 of 1
